{
  "basics": {
    "name": "Ulises Alejandro MORA QUINTANA",
    "label": "Desarrollador Full Stack, Desarrollador en la Nube y Desarrollador Indie de Juegos",
    "image": "/yo.jpeg",
    "bornPLace": "/born-place.png",
    "visa": "/visa.png",
    "email": "ulisesmora3@gmail.com",
    "phone": "+34 526715393",
    "url": "",
    "summary": "+5 años de experiencia trabajando con TS/JS, React, Angular, NestJS, ASP NET, Django trabajando con patrones de diseño SOLID y Arquitecturas Limpias como DDD en los últimos dos años. Experiencia trabajando en microservicios y funciones lambda. Trabajo con React Native e Ionic para aplicaciones móviles. Experiencia con nubes como AWS, Azure, Google Cloud y Terraform. Al final, me gusta el liderazgo y entender el propósito de los otros departamentos en función del producto.",
    "location": {
      "address": "Pintor rosales, Argüelles",
      "postalCode": "28008",
      "city": "Madrid",
      "countryCode": "ES",
      "region": "España"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "ulises-mora-437697139",
        "url": "https://www.linkedin.com/in/ulises-mora-437697139/"
      },
      {
        "network": "GitHub",
        "username": "ulisesmora",
        "url": "https://github.com/ulisesmora"
      }
    ]
  },
  "work": [
    {
      "name": "GPT4SALES",
      "position": "Líder de Backend e Ingeniero de Arquitectura",
      "startDate": "2024-01-01",
      "endDate": null,
      "summary": "Diseñar e implementar soluciones basadas en la nube, centrándose en una aplicación de chatbot utilizando OpenAI. Proporcionar orientación arquitectónica y liderazgo al equipo de desarrollo usando: ● NestJS ● Microservicios ● Redis ● GraphQL ● RabbitMQ ● MongoDB ● Postgres",
      "highlights": [
        "Buscamos un Arquitecto Líder y experto en la nube para diseñar e implementar soluciones basadas en la nube, centrándonos en una aplicación de chatbot utilizando OpenAI. Este rol utilizará tecnologías como NestJS, microservicios, Redis, GraphQL y RabbitMQ. Responsabilidades clave: Diseñar e implementar microservicios: desarrollar y mantener un sistema de 4 microservicios utilizando NestJS. Asegurar la escalabilidad, fiabilidad y rendimiento de la arquitectura de microservicios. Desarrollo de API: crear y gestionar APIs utilizando GraphQL para un intercambio de datos eficiente. Almacenamiento en caché y almacenamiento de datos: implementar Redis para soluciones de caché que mejoren el rendimiento de la aplicación. Corretaje de mensajes: integrar RabbitMQ para una eficiente intermediación de mensajes y comunicación entre servicios. Infraestructura en la nube: diseñar, desplegar y gestionar la infraestructura en la nube asegurando un rendimiento óptimo y eficiencia de costos. Liderar y orientar: proporcionar orientación arquitectónica y liderazgo al equipo de desarrollo."
      ]
    },
    {
      "name": "Autocom (México remoto)",
      "position": "Ingeniero Senior de ASP NET y de la Nube",
      "url": "https://autcom.mx",
      "startDate": "2023-07-01",
      "endDate": "2024-08-15",
      "summary": "● Migrar código de asp net core 2.2 a asp net 7 ● Dockerizar aplicaciones para migrar a microservicios ● Usar Nodejs y Postgres ● Mover proyectos a AWS utilizando Lambda, API Gateway y ECS ● Experiencia con patrones de diseño ● Actualizar rendimiento en aplicaciones utilizando almacenamiento en caché y mejores prácticas",
      "highlights": [
        "Inicié la empresa"
      ]
    },
    {
      "name": "PartsBadger (EEUU - remoto)",
      "position": "Desarrollador Fullstack",
      "url": "https://parts-badger.com",
      "startDate": "2023-06-01",
      "endDate": "2023-12-01",
      "summary": "● Desarrollar Backend en Django Rest utilizando RabbitMQ y Celery para tareas asincrónicas ● Construir un proyecto inicial con dockerización del frontend y backend ● Trabajar con arquitectura limpia como DDD en el frontend. ● Trabajar en la aplicación web frontend con React - Redux / RTK usando la última versión de React con Vite para un mejor rendimiento. ● Trabajar con Three.js en React para 3D",
      "highlights": [
        "Inicié la empresa"
      ]
    },
    {
      "name": "OmniDoc (Ciudad de México)",
      "position": "Desarrollador Fullstack",
      "startDate": "2022-05-01",
      "endDate": "2023-05-01",
      "summary": "Construcción de microservicios con NestJS y Python ● Uso de ORM (TypeORM en NestJS) con Postgres y GraphQL. ● Trabajo con arquitectura limpia como DDD ● Uso de CQRS para Microservicios ● Experiencia con patrones de diseño ● Liderando la aplicación web frontend con React - Redux y RTK y Angular ● Construcción de una función Lambda con Docker en AWS. ● Pruebas con Cypress.",
      "highlights": [
        "Inicié la empresa"
      ]
    },
    {
      "name": "Bambú Mobile (México - remoto)",
      "position": "Desarrollador Fullstack",
      "url": "https://bambu-mobile.com",
      "startDate": "2020-02-01",
      "endDate": "2022-05-01",
      "summary": "● Construcción de APIs con NestJS, Express, ASP NET Core, Django y Spring ● Experiencia con microservicios para aplicaciones web y aplicaciones móviles. ● Trabajo con Firebase (Hosting, Firestore, Cloud Messaging, etc.). ● Uso de ORM para Postgres, MariaDB, MongoDB, Microsoft SQL Server y Redis. ● Contribución en cada fase de entrega de proyectos en diferentes roles ● Uso de IONIC y React Native para construir aplicaciones Android e IOS. ● Uso de patrones de arquitectura para algunas aplicaciones de sistemas ● Implementación de CI/CD en AWS con TravisCI y Github Actions con Docker. ● Uso de AWS, Google Cloud, Firebase y Heroku. ● Configuración de servidores (Linux y Microsoft Windows Server) para aplicaciones web. ● Construcción de muchas aplicaciones web de una sola página con Angular, React, uso de Next y Angular Universal con SSR ● (REST, SOAP, Socket y GraphQL). ● AWS con EC2, Route53, ElasticBeanstalk, S3, ● Load Balancer, RDS, etc",
      "highlights": [
        "Inicié la empresa"
      ]
    },
    {
      "name": "Bblazar (Ciudad de México - mi propio proyecto)",
      "position": "Desarrollador Fullstack",
      "url": "https://www.bblazar.com/",
      "startDate": "2020-01-01",
      "endDate": null,
      "summary": "● Desarrollé dos aplicaciones Dapps con Solidity (contratos inteligentes ERC20 y ERC721) ejecutándose en Ethereum y el frontend desarrollado en Web3 con Next.js, también desarrollé una aplicación móvil en Android para una Dapp. ● Desarrollé un sitio de comercio electrónico con Angular Universal y creé una API con NestJS ● Experiencia trabajando con React Three para hacer sitios en 3D. ● Experiencia trabajando con Unity y Unreal para desarrollar experiencias AR/VR",
      "highlights": [
        "Inicié la empresa"
      ]
    }
  ],
  "volunteer": [{
    "organization": "Organización",
    "position": "Voluntario",
    "url": "https://organization.com/",
    "startDate": "2012-01-01",
    "endDate": "2013-01-01",
    "summary": "Descripción...",
    "highlights": [
      "Premiado como 'Voluntario del Mes'"
    ]
  }],
  "education": [{
    "institution": "UNAM - FI",
    "url": "https://unam.mx",
    "area": "Ingeniero en Computación - Ingeniero en Sistemas Ambientales con título de licenciatura (BSc.), UNAM, Ciudad de México",
    "studyType": "Licenciatura",
    "startDate": "2015-01-01",
    "endDate": "2019-09-01",
    "score": "8.3",
    "courses": null
  }],
  "awards": [{
    "title": "Premio",
    "date": "2014-11-01",
    "awarder": "Compañía",
    "summary": "No hay cuchara."
  }],
  "certificates": [{
    "name": "Certificado",
    "date": "2021-11-07",
    "issuer": "Compañía",
    "url": "https://certificate.com"
  }],
  "publications": [{
    "name": "Publicación",
    "publisher": "Compañía",
    "releaseDate": "2014-10-01",
    "url": "https://publication.com",
    "summary": "Descripción de la publicación"
  }],
  "skills": [{
    "name": "Habilidad",
    "level": "Principiante",
    "keywords": [
      "SEO",
      "SEM"
    ]
  }],
  "languages": [{
    "language": "Inglés",
    "fluency": "Intermedio"
  }],
  "interests": [{
    "name": "Interés",
    "keywords": [
      "Deportes",
      "Música"
    ]
  }],
  "references": [{
    "name": "Referencia",
    "reference": "Referencia..."
  }],
  "projects": [{
    "name": "Nombre del Proyecto",
    "description": "Descripción...",
    "highlights": [
      "Premiado como 'Mejor del Año'"
    ],
    "keywords": [
      "Desarrollo",
      "Diseño"
    ],
    "startDate": "2019-01-01",
    "endDate": "2020-01-01",
    "url": "https://project.com/",
    "roles": [
      "Desarrollador",
      "Diseñador"
    ],
    "entity": "Compañía",
    "type": "Aplicación"
  }]
}
